[
  {
    "id": "ZwS3a0YLeIE",
    "snippet": {
      "publishedAt": "2021-11-23T13:43:14Z",
      "title": "How to Convert your Quickbooks Desktop File to Quickbooks Online",
      "description": "How to Convert your Quickbooks Desktop File to Quickbooks Online\n\nNeed help with your startup’s bookkeeping? Kruze Consulting is a leader in providing low-cost, high-quality financials to funded startups. Learn more at https://kruzeconsulting.com/startup-bookkeeping\n\nThis is the new way. This is, we've been doing this for five years, join the cloud revolution. There's no reason to have all your QuickBooks information tied up in a single file when it can just be accessed online. QuickBooks Online is so much easier. So let me just tell you how to do this. I'm recording this video because we still get this request quite a bit when we're talking to new prospects. And so basically what you're going to do is you're going to, you log into QuickBooks Desktop and then make sure your file, like your whole QuickBooks Desktop is all up to date. Save that, save the file. A lot of people sometimes are doing this conversion when they don't actually have a QuickBooks Desktop program. \n\nLike this happens to us quite a bit. Like someone will send us their file. And so for us we have to actually download a trial version of QuickBooks Desktop. So you can just Google QuickBooks Desktop trial version, Intuit has some really good help links on this by the way. Download that trial piece of software, they will actually let you start or convert one account without having to pay for QuickBooks Desktop. So they're very nice about this. They want to incentivize you to get on QuickBooks Online as well. \n\nI think Kruze, on our website, you can click and we have a discount link you can just click through and I forget what the discount is, it's like 30% or something like that. Feel free to do that. And then you are going to, once you have your QuickBooks Online account set up, you are going to go back to QuickBooks Desktop and there is, in the file menu there is an export option you can do. You are going to click that and then it's going to run you through a series of prompts and ask you what the destination is and where in QuickBooks Online you want to convert it. It's all super easy. It's going to be like, it's easier than easy. It shouldn't take you like two minutes to do this, but it's going to be very obvious when you log in to the QuickBooks Online account, what the destination, what it's called. You're going to click \"convert\". You're going to give it, you're basically going to do that and then you're going to give it like 10 minutes. It's going to think, it's going to convert over. You'll get a message that says something like: we'll send you an email when your account has been converted over. \n\nAnd then you are going to go over to QuickBooks Online and refresh or maybe log out and sign in again. And make sure all your data is there. So you're going to want to kind of do a side-by-side comparison to make sure your income statement and your balance sheet, the general ledger, all match what is inside QuickBooks Desktop. I wouldn't recommend like a super thorough craziness, go through every line item. You're going to be able to tell if things are in there by what the balance sheet income statement look like, the general ledger. If everything matches, everything balances, everything's reconciled still, you should be fine. And then you will go over to \"manage my users\" with the, there's a little gear icon in the upper right. \n\nAnd you are going to manage your users and invite your friendly CPA firm, Kruze Consulting, to your accounts. Very, very easy. You do it as an accountant user. This, people don't know this necessarily, but being an account user gives you some superpowers. We can see all of the clients that we work with in one, you know, one giant console, and we can provision permission for each member of our team through that accountant console. So super important to give your accountant access as an accountant, not just as a normal user, because that'll make it kind of difficult for them, especially if you're doing this to get a quote. \n\nLike the context of this for us, a lot of times, if someone has been maybe working with like an old school accountant who only knows desktop, or maybe they have been doing it themselves, and they're looking to professionalize their bookkeeping and taxes. And so this whole kind of jump through these hoops is all to get it into a QuickBooks Online version, where we can easily deliver a quote and tell you what's going on in your book. So I hope this helps, again Intuit does have some really good resources, including some videos on this. So I'm not going to really do like a play by play, insert a play by play video here. But this commentary should be very helpful for you. \n\nBecause there's a couple of places where it gets a little sticky and you know, kind of a hard time knowing where to go. So I hope this helps. If you have any questions, hit us up at kruzeconsulting.com. We'll help you out and wish you the best of luck, thanks.",
      "thumbnails": {
        "default": {
          "url": "https://i.ytimg.com/vi/ZwS3a0YLeIE/default.jpg",
          "width": 120,
          "height": 90
        },
        "medium": {
          "url": "https://i.ytimg.com/vi/ZwS3a0YLeIE/mqdefault.jpg",
          "width": 320,
          "height": 180
        },
        "high": {
          "url": "https://i.ytimg.com/vi/ZwS3a0YLeIE/hqdefault.jpg",
          "width": 480,
          "height": 360
        },
        "standard": {
          "url": "https://i.ytimg.com/vi/ZwS3a0YLeIE/sddefault.jpg",
          "width": 640,
          "height": 480
        },
        "maxres": {
          "url": "https://i.ytimg.com/vi/ZwS3a0YLeIE/maxresdefault.jpg",
          "width": 1280,
          "height": 720
        }
      }
    },
    "contentDetails": {
      "duration": "PT4M55S",
      "dimension": "2d"
    },
    "name": "How to Convert your Quickbooks Desktop File to Quickbooks Online"
  },
  {
    "id": "F8HQj8zvhx4",
    "snippet": {
      "publishedAt": "2021-01-13T17:25:16Z",
      "title": "When is the best time to send out a W9 to a vendor to determine if they need a 1099?",
      "description": "When is the best time to send out a W9 to a vendor to determine if they need a 1099?\n\nKruze’s tax team helps hundreds of startups cumulatively save millions on their taxes every year - even unprofitable startups can benefit from tax credits. See how much a tax return might cost your company at https://kruzeconsulting.com/startup_calculators/how-much-does-a-startup-tax-return-cost\n\nHey, it's Scott Orn at Kruze Consulting. And today, we're talking about when's the right time to send a W9 to a vendor, so you can figure out if you need to give them a 1099 or not? \n\nSo let's start really slow here. A W9 is a taxpayer information form that's on the IRS website. Technically, you should send this to all of your vendors. But really, you're just worried about the vendors that are independent contractors, sole member LLCs, partnerships, folks like that. You don't have to worry about S corps or C corps. \n\nSo those folks that need a 1099 to basically state what you paid that vendor during the year on a cash basis, so that they can fill out their taxes. The IRS wants them to get a form so they can fill out their taxes. But also, the IRS wants to get that form themselves so they know what that person should be paying in taxes. So there's definitely a giant cross check happening here, where when that contractor fills out their income tax form, the IRS is checking to see what you paid them and what they actually declared. So that's why 1099s are done. \n\nNow 1099s are due every January 31st. And so if you don't do those, it's a really big deal. You'll get fined, I think it's like $1,000 or $2,000 per 1099 not filed. It may even be $10,000. It's a really big number. So you really wanna do this. So when are the best times of the year to send out that W9 so that you can determine whether the vendor gets a 1099 or not? \n\nSo the first one is, I like to send it out right away when you start working with them. Like when you're signing the contract, it's nice to kinda bundle that into the contract, or right before you pay the vendor, especially contractors. Sometimes contractors are disorganized. They're a little harder to reach throughout the year, and so if you can get that information right away, that's always helpful. Store it in a really safe place. \n\nBut sometimes it's kinda like, that's not really a scalable process to stop what you're doing all the time and send the W9. So the other alternative is to do it at the end of the year or right in January, when you're preparing all your 1099s. So and that, the cool thing about that is that allows you to run a giant batch process. And so it's very, very efficient with your time. And also, you've just determined, you've closed your books for the year. So you know exactly what you paid this person on a cash basis. So it makes filling out the 1099, after you get the W9 a lot easier. \n\nSo I would either do it right away, before you actually pay that vendor. Or do it in January, so you can do it in bulk and handle all of your vendors at the same time. The nice thing is using a tool that kinda hides the social security number is actually really important. You do not want a bunch of social security numbers flying back and forth in your email inbox, or in documents in your email inbox. You wanna really minimize that. That's just kind of a threat and it's liability you don't really wanna take. \n\nSo we really like using web tools like Track1099 to handle that stuff because they mask all the social security numbers. So again remember, you need to fill out 1099s every year for all your contractors, partnerships, sole member LLCs that you paid throughout the year. You're gonna do it on a cash basis. \n\nAnd you need to get those filed before January 31st. So it's really important to know the tax status of all those vendors, so that you can send those 1099s out when it's time. Hope that helps, thanks.",
      "thumbnails": {
        "default": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/default.jpg",
          "width": 120,
          "height": 90
        },
        "medium": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/mqdefault.jpg",
          "width": 320,
          "height": 180
        },
        "high": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/hqdefault.jpg",
          "width": 480,
          "height": 360
        },
        "standard": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/sddefault.jpg",
          "width": 640,
          "height": 480
        },
        "maxres": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/maxresdefault.jpg",
          "width": 1280,
          "height": 720
        }
      }
    },
    "contentDetails": {
      "duration": "PT3M35S",
      "dimension": "2d"
    },
    "name": "When is the best time to send out a W9 to a vendor to determine if they need a 1099?"
  },
  {
    "id": "dJf95pnOws8",
    "snippet": {
      "publishedAt": "2022-07-05T14:07:08Z",
      "title": "File Taxes on Time: The Single Most Important Reason for a Startup",
      "description": "In this video, you'll learn what happens if you don't file taxes on time for a startup or forget to file taxes on time.\n\n00:00 Introduction\n00:12 Startup taxes on time\n02:14 Please do your taxes on time\n03:30 Conclusion\n\n*******************************\nAdditional Resources\n\nhttps://www.youtube.com/watch?v=X2ct0qLSyL0\nhttps://www.youtube.com/watch?v=gGcK8MxFlII\n\n*******************************\n\nKruze’s tax team helps hundreds of startups cumulatively save millions on their taxes every year - even unprofitable startups can benefit from tax credits. See how much a tax return might cost your company at https://kruzeconsulting.com/startup_calculators/how-much-does-a-startup-tax-return-cost\n\n#filetaxesontime #startupbusiness  #taxes \n\nBe sure to subscribe for more accounting, HR, and finance tips for your startup.\nhttps://www.youtube.com/c/KruzeConsulting\n\nMORE FROM KRUZE CONSULTING:\nWebsite ► https://kruzeconsulting.com/\nYouTube ► https://www.youtube.com/c/KruzeConsulting\nFacebook ► https://www.facebook.com/KruzeConsulting\nTwitter ►https://twitter.com/KruzeConsulting\n\nHey, it's Scott Orn at Kruze Consulting, and today we're talking about the single best reason for doing your startup's taxes on time. \n\nAnd there's many reasons. You take care of your compliance. You don't look like a schmuck when the VCs want to give you a term sheet, or the acquirer comes, you know exactly what your tax obligations are. It's something you check off the list early in the year, instead of late in the year. There's a lot of benefits, but the single best benefit is that, if you file your return on time, you actually get to take advantage of what's called the R&D Tax Credit, which is a payroll tax offset. So a lot of times people come to us, they don't care, this is incorrect thinking, by the way, they don't think they need to worry about their taxes, doing them on time, because they lost money and they don't owe any money. \n\nObviously, if you make a profit, you do owe taxes to the IRS, and so you really want to file your taxes on time in that scenario, too. But these are startups that are losing money and then they think, \"Ah, who cares, doesn't matter.\" But what's happening is they're actually losing out on the payroll tax offset from the R&D Tax Credit. Now, if they file their taxes late, they can still get a tax credit, but it's a 20 year carry forward that can only be used against profits. So what's so cool about the payroll tax offset is pretty much everyone who has employees, who's building something, is going to pay payroll taxes. \n\nAnd so the IRS and Treasury allow you to deduct the credit against your payroll taxes. Now, you can only do that if it's filed in a timely manner, to quote the wonderful Internal Revenue Service, the IRS. So, all those startups who are blowing their deadlines, not filing extensions, not caring, are probably costing themselves on, for a seed stage company, it might be $20K. For a Series A company, it's probably 50 to $100K. For Series B companies it can be up to $250K in payroll tax offsets that come from the R&D Tax Credit. \n\nSo this is why I bang on the table and say, \"Please do your taxes on time.\" Also make sure, side note, you're working with someone who actually understands startup taxes. There's so many companies that come to us that have the local bookkeeper or CPA, or they hired someone on Craigslist, or they're working with an online accounting firm that outsources everything to third parties, and doesn't actually do any taxes, even though they advertise they do taxes on their website, which I think that, I don't know if that's actually even kosher or legal, but we see it happen. \n\nAnd these people are groups. They're small time and they don't actually understand tax credits. They don't understand the importance of doing your tax returns on time. They don't understand the importance of actually doing a good, accurate tax return, and having those tax returns match the financials. The first thing that happens when you're going to get acquired, or a VC fund is going to invest in you, is they open your financials. \n\nThey open your tax return. If those do not match, there's a problem, so please do them on time, and do them with someone reputable who actually really knows what they're doing, and look for that CPA designation. That is the industry accreditation. The government regulates CPA firms. They don't regulate people who use third party tax services, or the local Craigslist bookkeeper. \n\nAnd so you can make sure you're getting it done properly if you work with a CPA, kind of like Kruze Consulting. Check us out at kruzeconsulting.com if you have more questions about doing your taxes on time or any tax credits, the payroll tax offsets, anything related to startups, and finance and taxes, we're there. And please subscribe this channel if you don't mind.",
      "thumbnails": {
        "default": {
          "url": "https://i.ytimg.com/vi/dJf95pnOws8/default.jpg",
          "width": 120,
          "height": 90
        },
        "medium": {
          "url": "https://i.ytimg.com/vi/dJf95pnOws8/mqdefault.jpg",
          "width": 320,
          "height": 180
        },
        "high": {
          "url": "https://i.ytimg.com/vi/dJf95pnOws8/hqdefault.jpg",
          "width": 480,
          "height": 360
        },
        "standard": {
          "url": "https://i.ytimg.com/vi/dJf95pnOws8/sddefault.jpg",
          "width": 640,
          "height": 480
        },
        "maxres": {
          "url": "https://i.ytimg.com/vi/dJf95pnOws8/maxresdefault.jpg",
          "width": 1280,
          "height": 720
        }
      }
    },
    "contentDetails": {
      "duration": "PT4M9S",
      "dimension": "2d"
    },
    "name": "File Taxes on Time: The Single Most Important Reason for a Startup"
  },
  {
    "id": "7Nr9yi9YDsQ",
    "snippet": {
      "publishedAt": "2022-06-09T12:55:07Z",
      "title": "How Is SAAS Revenue Recognition From Annual Contracts Billed Upfront?",
      "description": "In this video, you'll learn about SAAS revenue recognition from annual contracts billed up front.\n\n*******************************\nAdditional Resources\n\nhttps://www.youtube.com/watch?v=43u0eX5Dbhk\nhttps://www.youtube.com/watch?v=6WlmSM5g-mk\nhttps://www.youtube.com/watch?v=XqFSgLjRrY4\n\n*******************************\n\nDoes your VC-backed startup need help to manage your books, burn, and projections? Kruze’s clients have raised over $6 billion in venture funding - find out how we help companies fly through diligence and raise the next round: https://kruzeconsulting.com/startup-venture-capital-finance-experts \n\n#saasrevenuerecognition #saasrevenue #kruzeconsulting\n\nBe sure to subscribe for more accounting, HR, and finance tips for your startup.\nhttps://www.youtube.com/c/KruzeConsulting\n\nMORE FROM KRUZE CONSULTING:\nWebsite ► https://kruzeconsulting.com/\nYouTube ► https://www.youtube.com/c/KruzeConsulting\nFacebook ► https://www.facebook.com/KruzeConsulting\nTwitter ►https://twitter.com/KruzeConsulting\n\nHey, it's Scott Orn at Kruze Consulting and today I'm answering the question, how do SaaS companies recognize revenue on contracts that are annual and billed and collected upfront? This is a very common question. \n\nThe answer is you always want to use accrual GAAP-based accounting and you always want to recognize that revenue on a monthly basis as you provide the service over the year. It doesn't matter if you collected the cash up front. If you booked it that way that would be called cash accounting. That's not accrual. That's not the right way to do things for startups. That's not the way that VCs, that's not the way that corporate development offices, they don't view your financials that way. They don't wanna see your financials that way. \n\nThey want to see 'em on an accrual basis every time. And it's better for management and for the investors. Imagine you're sitting in a board meeting and you haven't been booking your reoccurring revenue stream on a monthly basis and your revenue, 'cause it's on cash, is bouncing all around and the board is freaking out because they invested in a SaaS company, thinking this is gonna be a smooth, long build. \n\nAnd you put up a zero this month, right? People are gonna lose their minds. So you're gonna take a lot of grief if your revenue is not booked correctly. And imagine when you go through an M&A, like if the corporate development group or the accounting firm that they hired to do due diligence on you, is looking at this and it's cash accounting, again bouncing all over, not consistent, not SaaS-like, they're gonna be worried that they're working or buying a company that isn't run by a super sophisticated team. They're also gonna be worried that the accounting firm that you're using is not doing their job correctly. \n\nAnd the next natural step is, well, what else is wrong? What else do I not know about? What's lurking beneath the surface here in this M&A deal? And it could literally make the deal fall apart. It could make them give you a haircut. There's a lot of bad things that could happen. So do your revenue recognition correctly, work with a CPA firm that knows what they're doing, that will be there for you during diligence, and always book this stuff on a monthly basis as you earn the revenue as you deliver the service. It doesn't matter if you collect the cash up front, although that's really good for mitigating your burn. \n\nSo definitely try to collect upfront if possible. Hope that helps. If you have any questions on revenue recognition, SaaS companies, hit us up at kruzeconsulting.com and hey, while you're on our YouTube channel if you don't mind clicking the old subscribe button we'd appreciate it. We put a lot of time and energy into these videos and hope you see more of them. Thanks.",
      "thumbnails": {
        "default": {
          "url": "https://i.ytimg.com/vi/7Nr9yi9YDsQ/default.jpg",
          "width": 120,
          "height": 90
        },
        "medium": {
          "url": "https://i.ytimg.com/vi/7Nr9yi9YDsQ/mqdefault.jpg",
          "width": 320,
          "height": 180
        },
        "high": {
          "url": "https://i.ytimg.com/vi/7Nr9yi9YDsQ/hqdefault.jpg",
          "width": 480,
          "height": 360
        },
        "standard": {
          "url": "https://i.ytimg.com/vi/7Nr9yi9YDsQ/sddefault.jpg",
          "width": 640,
          "height": 480
        },
        "maxres": {
          "url": "https://i.ytimg.com/vi/7Nr9yi9YDsQ/maxresdefault.jpg",
          "width": 1280,
          "height": 720
        }
      }
    },
    "contentDetails": {
      "duration": "PT2M46S",
      "dimension": "2d"
    },
    "name": "How Is SAAS Revenue Recognition From Annual Contracts Billed Upfront?"
  },
  {
    "id": "_qCrd2sO7dY",
    "snippet": {
      "publishedAt": "2021-06-29T15:24:24Z",
      "title": "How should you present your startup's financial results to the board?",
      "description": "How should you present your startup's financial results to the board?\n\nDoes your VC-backed startup need help to manage your books, burn, and projections? Kruze’s clients have raised over $3.5 billion in venture funding - find out how we help companies fly through diligence and raise the next round: https://kruzeconsulting.com/startup-venture-capital-finance-experts\n\nThe first one is like cash versus accrual accounting. The second one is like any kind of vanity metrics or metrics that make you look good. And then the third one is kind of the order and the presentation. So first we're going to go cash and accrual. So this is a very common question from our startup founders and really everything should basically be on accrual except you do want to include the pure cash burn number. So your revenue, your costs, your costs of goods sold, all that stuff and your net income, all that should be on accrual basis. But I like to show the board the actual cash burn. So I'll give them what we call like accrual burn which is usually taken from like your operating income line or your net income line. But that's an accounting burn rate. And then I also like to show them a cash burn which is like purely the amount of cash you had in the bank account last month, the amount of cash you have right now and the difference. And that is your true cash burn. \n\nSo, I like to show, you know, again, accrual for everything and then show an additional cash burn, that's the pure cash burn. And then for vanity metrics, I like to do things like especially if you're a SaaS company, things like bookings. So that's usually like the total contract value of deals that you've recognized or signed in a given month. And the reason why that's important is bookings tend to be a forward indicator. And so if you're signing a bunch of contracts that are one-year, two-year, three-year contracts, that means your revenue's going to be really good in the future as you recognize those contracts and deliver the service. \n\nAnd so the board wants to know that. Some of the other, I wouldn't put this in the summary but other vanity metrics can be like LTV of customer or cost of acquisition and things like that. But I'm really talking about kind of your summary page here. And so, but I do think bookings is a really good way of showing the traction that's happening in the business and it's not going to show up in just your pure revenue recognition right away. So those are kind of the two, the first categories we're going to talk about. \n\nAnd the third one is just what does this actually look like? So I love to have a one-page financial summary very early in a board deck. And the reason for that is the board, they don't always know exactly what's going on financially at the company. So sometimes they're a little jittery or they're just a little nervous and they really kind of need some level setting and you want to let them know where you are. \n\nSo I always like to have just a one-page summary. And this is again, there to kind of level set for them. Just get them oriented and give them a framework to think about the company. What milestones it needs to hit and where you are right now. And so that one page should have something like cash, cash burn for like the last month or last three months or last six months, we give our clients all those metrics. And then your total months of runway and then revenue and ideally bookings. \n\nAnd, really those five metrics will give them, venture capitalists talk to startups all day long. They're very good at doing the back of the envelope math on all financials very quickly. But that will just give them a foundation to look at the rest of your presentation and know if your business has plenty of cash and you don't need to worry. Or, \"Hey, we're getting a little bit low on cash. We need to think about fundraising.\" And they'll be doing the metrics calculations in their head and thinking like, \"Can this company raise another round or do we need to pare back? Whatever we need to do.\" That will help your board. \n\nAnd then the final thing just when you're talking about board meetings I like to have a much fuller, like kind of almost like a section of the presentation late in the board deck with your full profit and loss statement or like a summary but all the big line items, a balance sheet and ideally a cashflow statement. I also really like to show budget to actuals whenever possible on those things. And especially if you're a good management team and you're executing, budget to actuals actually build a ton of confidence in your investors. They know that you're managing the company tightly. It's a little bit of a cheat sheet for them because it actually allows them to ask smart questions, too. They'll see things are out of whack if you're under-hiring or over-hiring or just spending money too much, too fast on marketing, things like that.",
      "thumbnails": {
        "default": {
          "url": "https://i.ytimg.com/vi/_qCrd2sO7dY/default.jpg",
          "width": 120,
          "height": 90
        },
        "medium": {
          "url": "https://i.ytimg.com/vi/_qCrd2sO7dY/mqdefault.jpg",
          "width": 320,
          "height": 180
        },
        "high": {
          "url": "https://i.ytimg.com/vi/_qCrd2sO7dY/hqdefault.jpg",
          "width": 480,
          "height": 360
        },
        "standard": {
          "url": "https://i.ytimg.com/vi/_qCrd2sO7dY/sddefault.jpg",
          "width": 640,
          "height": 480
        },
        "maxres": {
          "url": "https://i.ytimg.com/vi/_qCrd2sO7dY/maxresdefault.jpg",
          "width": 1280,
          "height": 720
        }
      }
    },
    "contentDetails": {
      "duration": "PT6M1S",
      "dimension": "2d"
    },
    "name": "How should you present your startup's financial results to the board?"
  }
]