[
  {
    "id": "ZwS3a0YLeIE",
    "snippet": {
      "publishedAt": "2021-11-23T13:43:14Z",
      "channelId": "UC8qjLBOmEoaugV2n47eaUrg",
      "title": "How to Convert your Quickbooks Desktop File to Quickbooks Online",
      "description": "How to Convert your Quickbooks Desktop File to Quickbooks Online\n\nNeed help with your startup’s bookkeeping? Kruze Consulting is a leader in providing low-cost, high-quality financials to funded startups. Learn more at https://kruzeconsulting.com/startup-bookkeeping\n\nThis is the new way. This is, weve been doing this for five years, join the cloud revolution. Theres no reason to have all your QuickBooks information tied up in a single file when it can just be accessed online. QuickBooks Online is so much easier. So let me just tell you how to do this. Im recording this video because we still get this request quite a bit when were talking to new prospects. And so basically what youre going to do is youre going to, you log into QuickBooks Desktop and then make sure your file, like your whole QuickBooks Desktop is all up to date. Save that, save the file. A lot of people sometimes are doing this conversion when they dont actually have a QuickBooks Desktop program. nnLike this happens to us quite a bit. Like someone will send us their file. And so for us we have to actually download a trial version of QuickBooks Desktop. So you can just Google QuickBooks Desktop trial version, Intuit has some really good help links on this by the way. Download that trial piece of software, they will actually let you start or convert one account without having to pay for QuickBooks Desktop. So theyre very nice about this. They want to incentivize you to get on QuickBooks Online as well. \n\nI think Kruze, on our website, you can click and we have a discount link you can just click through and I forget what the discount is, its like 30% or something like that. Feel free to do that. And then you are going to, once you have your QuickBooks Online account set up, you are going to go back to QuickBooks Desktop and there is, in the file menu there is an export option you can do. You are going to click that and then its going to run you through a series of prompts and ask you what the destination is and where in QuickBooks Online you want to convert it. Its all super easy. Its going to be like, its easier than easy. It shouldnt take you like two minutes to do this, but its going to be very obvious when you log in to the QuickBooks Online account, what the destination, what its called. Youre going to click "convert". Youre going to give it, youre basically going to do that and then youre going to give it like 10 minutes. Its going to think, its going to convert over. Youll get a message that says something like: well send you an email when your account has been converted over. \n\nAnd then you are going to go over to QuickBooks Online and refresh or maybe log out and sign in again. And make sure all your data is there. So youre going to want to kind of do a side-by-side comparison to make sure your income statement and your balance sheet, the general ledger, all match what is inside QuickBooks Desktop. I wouldnt recommend like a super thorough craziness, go through every line item. Youre going to be able to tell if things are in there by what the balance sheet income statement look like, the general ledger. If everything matches, everything balances, everythings reconciled still, you should be fine. And then you will go over to \"manage my users\" with the, theres a little gear icon in the upper right. nnAnd you are going to manage your users and invite your friendly CPA firm, Kruze Consulting, to your accounts. Very, very easy. You do it as an accountant user. This, people dont know this necessarily, but being an account user gives you some superpowers. We can see all of the clients that we work with in one, you know, one giant console, and we can provision permission for each member of our team through that accountant console. So super important to give your accountant access as an accountant, not just as a normal user, because thatll make it kind of difficult for them, especially if youre doing this to get a quote. \n\nLike the context of this for us, a lot of times, if someone has been maybe working with like an old school accountant who only knows desktop, or maybe they have been doing it themselves, and theyre looking to professionalize their bookkeeping and taxes. And so this whole kind of jump through these hoops is all to get it into a QuickBooks Online version, where we can easily deliver a quote and tell you whats going on in your book. So I hope this helps, again Intuit does have some really good resources, including some videos on this. So Im not going to really do like a play by play, insert a play by play video here. But this commentary should be very helpful for you. nnBecause theres a couple of places where it gets a little sticky and you know, kind of a hard time knowing where to go. So I hope this helps. If you have any questions, hit us up at kruzeconsulting.com. Well help you out and wish you the best of luck, thanks.,
      thumbnails: {
        default: {
          url: https://i.ytimg.com/vi/ZwS3a0YLeIE/default.jpg,
          width: 120,
          height: 90
        },
        medium: {
          url: https://i.ytimg.com/vi/ZwS3a0YLeIE/mqdefault.jpg,
          width: 320,
          height: 180
        },
        high: {
          url: https://i.ytimg.com/vi/ZwS3a0YLeIE/hqdefault.jpg,
          width: 480,
          height: 360
        },
        standard: {
          url: https://i.ytimg.com/vi/ZwS3a0YLeIE/sddefault.jpg,
          width: 640,
          height: 480
        },
        maxres: {
          url: https://i.ytimg.com/vi/ZwS3a0YLeIE/maxresdefault.jpg,
          width: 1280,
          height: 720
        }
      },
      channelTitle: Kruze Consulting,
      categoryId: 28,
      liveBroadcastContent: none,
      defaultAudioLanguage: en
    },
    contentDetails: {
      duration: PT4M55S,
      dimension: 2d,
      definition: hd,
      caption: false,
      licensedContent: false,
      contentRating: {},
      projection: rectangular
    },
    name: How to Convert your Quickbooks Desktop File to Quickbooks Online
  },
  {
    id: F8HQj8zvhx4,
    snippet: {
      publishedAt: 2021-01-13T17:25:16Z,
      channelId: UC8qjLBOmEoaugV2n47eaUrg,
      title: When is the best time to send out a W9 to a vendor to determine if they need a 1099?,
      description: When is the best time to send out a W9 to a vendor to determine if they need a 1099?nnKruze’s tax team helps hundreds of startups cumulatively save millions on their taxes every year - even unprofitable startups can benefit from tax credits. See how much a tax return might cost your company at https://kruzeconsulting.com/startup_calculators/how-much-does-a-startup-tax-return-costnnHey, its Scott Orn at Kruze Consulting. And today, were talking about whens the right time to send a W9 to a vendor, so you can figure out if you need to give them a 1099 or not? \n\nSo lets start really slow here. A W9 is a taxpayer information form thats on the IRS website. Technically, you should send this to all of your vendors. But really, youre just worried about the vendors that are independent contractors, sole member LLCs, partnerships, folks like that. You dont have to worry about S corps or C corps. \n\nSo those folks that need a 1099 to basically state what you paid that vendor during the year on a cash basis, so that they can fill out their taxes. The IRS wants them to get a form so they can fill out their taxes. But also, the IRS wants to get that form themselves so they know what that person should be paying in taxes. So theres definitely a giant cross check happening here, where when that contractor fills out their income tax form, the IRS is checking to see what you paid them and what they actually declared. So thats why 1099s are done. \n\nNow 1099s are due every January 31st. And so if you dont do those, its a really big deal. Youll get fined, I think its like $1,000 or $2,000 per 1099 not filed. It may even be $10,000. Its a really big number. So you really wanna do this. So when are the best times of the year to send out that W9 so that you can determine whether the vendor gets a 1099 or not? nnSo the first one is, I like to send it out right away when you start working with them. Like when youre signing the contract, its nice to kinda bundle that into the contract, or right before you pay the vendor, especially contractors. Sometimes contractors are disorganized. Theyre a little harder to reach throughout the year, and so if you can get that information right away, thats always helpful. Store it in a really safe place. nnBut sometimes its kinda like, thats not really a scalable process to stop what youre doing all the time and send the W9. So the other alternative is to do it at the end of the year or right in January, when youre preparing all your 1099s. So and that, the cool thing about that is that allows you to run a giant batch process. And so its very, very efficient with your time. And also, youve just determined, youve closed your books for the year. So you know exactly what you paid this person on a cash basis. So it makes filling out the 1099, after you get the W9 a lot easier. \n\nSo I would either do it right away, before you actually pay that vendor. Or do it in January, so you can do it in bulk and handle all of your vendors at the same time. The nice thing is using a tool that kinda hides the social security number is actually really important. You do not want a bunch of social security numbers flying back and forth in your email inbox, or in documents in your email inbox. You wanna really minimize that. Thats just kind of a threat and its liability you dont really wanna take. nnSo we really like using web tools like Track1099 to handle that stuff because they mask all the social security numbers. So again remember, you need to fill out 1099s every year for all your contractors, partnerships, sole member LLCs that you paid throughout the year. Youre gonna do it on a cash basis. \n\nAnd you need to get those filed before January 31st. So its really important to know the tax status of all those vendors, so that you can send those 1099s out when its time. Hope that helps, thanks.",
      "thumbnails": {
        "default": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/default.jpg",
          "width": 120,
          "height": 90
        },
        "medium": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/mqdefault.jpg",
          "width": 320,
          "height": 180
        },
        "high": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/hqdefault.jpg",
          "width": 480,
          "height": 360
        },
        "standard": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/sddefault.jpg",
          "width": 640,
          "height": 480
        },
        "maxres": {
          "url": "https://i.ytimg.com/vi/F8HQj8zvhx4/maxresdefault.jpg",
          "width": 1280,
          "height": 720
        }
      },
      "channelTitle": "Kruze Consulting",
      "categoryId": "28",
      "liveBroadcastContent": "none",
      "defaultAudioLanguage": "en"
    },
    "contentDetails": {
      "duration": "PT3M35S",
      "dimension": "2d",
      "definition": "hd",
      "caption": "false",
      "licensedContent": false,
      "contentRating": {},
      "projection": "rectangular"
    },
    "name": "When is the best time to send out a W9 to a vendor to determine if they need a 1099?"
  }
]
